package core.basesyntax;

public class FootballMatch {

    /**
     * <p>Реалізуй метод matchResult() за допомогою тернарного оператора. Метод має приймати 4 параметри:
     * result1 — рахунок першої команди;
     * result2 — рахунок другої команди;
     * bet1 — передбачення рахунку для першої команди;
     * bet2 — передбачення рахунку для другої команди.

     Твоє завдання:

     * поверни 2, якщо передбачення є на 100% вірним;
     * поверни 1, якщо передбачення є частково вірним, тобто вказує хто переміг або програв (наприклад, рахунок 1:2, а передбачення 0:3), або рахунок був в нічию та передбачення було в нічию (наприклад, рахунок 2:2, а передбачення 1:1);
     * поверни 0, якщо передбачення є зовсім невірним.</p>
     */
    public int matchResult(int result1, int result2, int bet1, int bet2) {
        if (result1 == bet1 && result2 == bet2) {
            return 2;
        }
        if (result1 > result2 && bet1 > bet2 || result2 > result1 && bet2 > bet1) {
            return 1;
        }
        return 0;
    }
}
